image = imread('acropolis.png');
I = rgb2gray(image);
figure(1);
imshow(I);
title('Original Image (grayscale)', 'FontSize', 14);
set(gcf, 'Color', [1, 1, 1]);
% Do (85, 112) and (362, 505) for thresh = 0.4444 and thresh = 0.4888
I = double(I)/255;  % Κανονικοποίηση των τιμών φωτεινότητας των
                    % εικονοστοιχείων για ευκολότερες πράξεις
[M, N] = size(I);   % Λήψη μεγέθους εικόνας (σειρές και στήλες)
[y, x] = getpts;    % Λήψη σημείου εκκίνησης region growing από διπλό
                    % κλικ πάνω στην αρχική εικόνα
x1 = round(x);      % Στρογυλλοποίηση στην τεμημένη (άξονας x)
y1 = round(y);      % Στρογυλλοποίηση στην τεταγμένη (άξονας y)
seed = I(x1, y1);   % Αποθήκευση του gray value του σημείου έναρξης
                    % για το region growing
Y = zeros(M, N);    % Αρχικοποίηση μητρώου ίδιου μεγέθους με την αρχική
                    % εικόνα στην οποία θα εγγραφεί το αποτέλεσμα
Y(x1, y1) = seed;   % Ορισμός χρώματος του σημείου στο Y ίδιο
                    % με το χρώμα του επιλεγμένου εικονοστοιχείου
sum = seed;         % Αποθήκευση του αθροίσματος των gray value των
                    % σημείων που πληρούν τις region growing συνθήκες
suit = 1;           % Αποθήκευση του πλήθους των σημείων που πληρούν τις
                    % region growing συνθήκες της περιοχής (suitable)
count = 1;          % Καταγραφή του αριθμού των νέων σημείων που πληρούν
                    % τα κριτήρια στα οκτώ σημεία γύρω από ένα σημείο
                    % κάθε φορά
thresh = 0.4888;    % Κατώφλι

while count > 0
    s = 0;          % Καταγραφή του αθροίσματος των gray value των νέων
                    % σημείων που πληρούν τα κριτήρια στα οκτώ σημεία 
                    % γύρω από ένα σημείο
    count = 0;
    for i = 1:M
        for j = 1:N
            % Έλεγχος του αν το σημείο έχει το ίδιο gray value με το seed
            if Y(i, j) == seed
                % Προσδιορισμός του αν αυτό το σημείο βρίσκεται στο όριο
                if (i-1) > 0 && (i+1) < (M+1) && (j-1) > 0 && (j+1) < (N+1)
                    % Προσδιορισμός του αν τα γύρω σημεία πληρούν 
                    % τις συνθήκες πεδίου. Τα u,v αποτελούν offset
                    for u = -1:1
                        for v = -1:1
                            % Κρίνεται αν υπάρχει ή όχι στον πίνακα 
                            % εξόδου Y και είναι ένα σημείο που
                            % ικανοποιεί τη συνθήκη
                            if (Y(i+u, j+v) == 0 && ...
                                    abs(I(i+u, j+v) - seed) <= thresh)
                                % Σύμφωνα με τις δύο παραπάνω συνθήκες,
                                % το σημείο που αντιστοιχεί στη θέση 
                                % στο Υ ορίζεται στο χρώμα του seed
                                Y(i+u, j+v) = seed;
                                count = count + 1;
                                % Το gray level αυτού του σημείου
                                % αθροίζεται στο s
                                s = s + I(i+u, j+v);
                            end
                        end
                    end
                end
            end
        end
    end
    
    sum = sum + s;      % Πρόσθεση του s στο άθροισμα του grayscale σημείου
    seed = sum / suit;  % Υπολογισμός του νέου μέσου όρου grayscale
end

figure(2);
imshow(Y);
title('Segmented image', 'FontSize', 14);
set(gcf, 'Color', [1, 1, 1]);